Repository: DemocracyClub/ec-postcode-lookup-pages
Catalog: postcode_lookup/locale/*/LC_MESSAGES/messages.po
Languages: cy

source: Where to vote
cy: Ble i bleidleisio

source: Voting by post
cy: Pleidleisio drwy'r post

source: Voter registration
cy: Cofrestru pleidleiswyr

source: Contact details
cy: Manylion cyswllt

source: There are no upcoming elections in your area
cy: Nid oes etholiadau ar y gweill yn eich ardal

source: Uncontested
cy: Heb gystadleuaeth

source: Postponed
cy: Wedi'i ohirio

source: You have an election today
cy: Mae gennych etholiad heddiw

source: You have an upcoming election
cy: Mae gennych etholiad sydd ar y gweill

source: You have upcoming elections
cy: Mae gennych etholiadau sydd ar y gweill

source: Your local council
cy: Eich cyngor lleol

source: Electoral registration
cy: Cofrestru etholiadol

source: one
cy: un

source: two
cy: dau

source: three
cy: tri

source: four
cy: pedwar

source: five
cy: pump

source: six
cy: chwech

source: seven
cy: saith

source: eight
cy: wyth

source: nine
cy: naw

source: (postponed)
cy: (wedi'i ohirio)

source: What this tool can tell you
cy: Beth all yr offeryn hwn ddweud wrthych

source: There is a recall petition in your area
cy: Mae deiseb adalw yn eich ardal

source: This election has been postponed due to the death of one of the candidates. A new election will be held within 35 working days of the initial election date (%(initial_poll_date)s).
cy: Mae'r etholiad hwn wedi'i ohirio oherwydd marwolaeth un o'r ymgeiswyr. Bydd etholiad newydd yn cael ei gynnal o fewn 35 diwrnod gwaith o'r dyddiad etholiad cychwynnol (%(initial_poll_date)s).

source: This election was postponed because the number of candidates who stood was fewer than the number of available seats. The election will be rescheduled and held within 35 days of the original polling day (%(initial_poll_date)s).
cy: Fe ohiriwyd yr etholiad hwn gan fod nifer yr ymgeiswyr a safodd yn llai na nifer y seddau sydd ar gael. Bydd yr etholiad yn cael ei aildrefnu a'i gynnal o fewn 35 diwrnod o'r diwrnod pleidleisio gwreiddiol (%(initial_poll_date)s).

source: Feedback
cy: Adborth

source: Did you find what you were looking for? If not, <a href="/node/24756">let us know</a>
cy: A wnaethoch chi ddod o hyd i'r hyn roeddech yn chwilio amdano? Os na, <a href="/node/24756">rhowch wybod i ni</a>

source: Elections in your area
cy: Etholiadau yn eich ardal

source: Find upcoming elections in your area, your polling station, candidates, and contact details for your local electoral services team
cy: Dewch o hyd i etholiadau sydd ar ddod yn eich ardal, eich gorsaf bleidleisio, ymgeiswyr, a manylion cyswllt eich tîm gwasanaethau etholiadol lleol

source: Send your postal and proxy vote applications to your local electoral registration team. You can also contact them to find out if you’re on the electoral register, and if you already have a postal or proxy vote.
cy: Anfonwch eich ceisiadau pleidleisio post a dirprwy i'ch tîm cofrestru etholiadol lleol. Gallwch hefyd gysylltu â hwy i ddarganfod a ydych chi ar y gofrestr etholiadol, ac os oes gennych bleidlais post neu dirprwy eisoes.

source: Electoral Office for Northern Ireland
cy: Swyddfa Etholiadol Gogledd Iwerddon

source: For questions about your poll card, polling place, or about returning your postal voting ballot, contact the Electoral Office for Northern Ireland.
cy: Am gwestiynau am eich cerdyn pleidleisio, eich man pleidleisio, neu am ddychwelyd eich papur pleidleisio post, cysylltwch â Swyddfa Etholiadol Gogledd Iwerddon.

source: <p>For questions about your poll card, polling station, or about returning your postal voting ballot, contact your council.</p>
cy: <p>Am gwestiynau am eich cerdyn pleidleisio, eich gorsaf bleidleisio, neu am ddychwelyd eich papur pleidleisio post, cysylltwch â'ch cyngor.</p>

source: Phone: <span>%(number)s</span>
cy: Ffôn: <span>%(number)s</span>

source: Email: <span>%(email)s</span>
cy: E-bost: <span>%(email)s</span>

source: %(org_name)s website
cy: Gwefan %(org_name)s

source: Website
cy: Gwefan

source: (Opens in new window)
cy: (Yn agor mewn ffenestr newydd)

source: Your polling station
cy: Eich gorsaf bleidleisio

source: Opening times
cy: Oriau agor

source: If you know that you won't be able to get to the polling station on polling day, you can vote by post.
cy: Os byddwch yn gwybod na fydd modd i chi gyrraedd eich gorsaf bleidleisio ar y diwrnod pleidleisio, gallwch bleidleisio drwy'r post.

source: You have until %(date)s.
cy: Mae gennych hyd nes %(date)s

source: If you have a postal vote
cy: Os oes gennych bleidlais bost

source: Your local council will send your postal voting pack after the deadline to become a candidate has passed. This is around three weeks before polling day.
cy: Bydd eich cyngor lleol yn anfon eich pecyn pleidleisio drwy’r post ar ôl i’r dyddiad cau ar gyfer dod yn ymgeisydd fynd heibio. Mae hyn tua thair wythnos cyn y diwrnod pleidleisio.

source: <p>The deadline to register to vote on %(date)s was %(registration_deadline)s.</p> <p>If you registered to vote before the deadline, then you will be able to vote in this election. <a href="#electoral_services">Contact your council</a> to check if you are on the register.</p> <p>You can <a href="https://gov.uk/register-to-vote/">register to vote</a> in future elections.</p>
cy: <p>Y dyddiad cau i gofrestru i bleidleisio ar %(date)s oedd %(registration_deadline)s.</p> <p>Os cofrestrwyd chi i bleidleisio cyn y dyddiad cau, yna byddwch yn gallu pleidleisio yn yr etholiad hwn. <a href="#electoral_services">Cysylltwch â'ch cyngor</a> i wirio os ydych ar y gofrestr.</p> <p>Gallwch <a href="https://gov.uk/register-to-vote/">gofrestru i bleidleisio</a> mewn etholiadau yn y dyfodol.</p>

source: You will have %(count)s ballot papers to fill out:
cy: Bydd gennych %(count)s papurau pleidleisio i'w llenwi:
